In [2]:
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
s = pd.Series(["홍길동", 28], index=["Name", "Age"])  # 28 역시 문자열임에 유의
s["Name"], s["Age"]

('홍길동', 28)

In [4]:
kor_s = pd.Series([80, 75, 90, 100, 65])
kor_s.describe()

count      5.000000
mean      82.000000
std       13.509256
min       65.000000
25%       75.000000
50%       80.000000
75%       90.000000
max      100.000000
dtype: float64

In [5]:
kor_s.std()

13.509256086106296

In [6]:
kor_s.isin([100])

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [7]:
s2 = pd.Series([1, 5, 6, 8, 4, 1, 4, 10])
kor_s + s2

0     81.0
1     80.0
2     96.0
3    108.0
4     69.0
5      NaN
6      NaN
7      NaN
dtype: float64

In [8]:
scores_df = pd.DataFrame({
    "KOR": [80, 90, 75],
    "ENG": [90, 80, 70],
    "MATH": [80, 90, 85]
}, index=["홍길동", "김철수", "이영희"])
scores_df

     KOR  ENG  MATH
홍길동   80   90    80
김철수   90   80    90
이영희   75   70    85

In [14]:
scores_df.loc["김철수"], type(scores_df.loc["김철수"])

(KOR     90
 ENG     80
 MATH    90
 Name: 김철수, dtype: int64,
 pandas.core.series.Series)

In [15]:
scores_df["TOTAL"] = scores_df["KOR"] + scores_df["ENG"] + scores_df["MATH"]
scores_df["AVERAGE"] = scores_df["TOTAL"] / 3
scores_df

     KOR  ENG  MATH  TOTAL    AVERAGE
홍길동   80   90    80    250  83.333333
김철수   90   80    90    260  86.666667
이영희   75   70    85    230  76.666667

In [20]:
filtered_df = scores_df[scores_df["AVERAGE"] > 80]
filtered_df

     KOR  ENG  MATH  TOTAL    AVERAGE
홍길동   80   90    80    250  83.333333
김철수   90   80    90    260  86.666667